---
kind: method
id: M:Autodesk.Revit.DB.CategoryNameMap.Insert(System.String,Autodesk.Revit.DB.Category)
source: html/18ff0437-a581-9cf3-ed34-c8d0e8e4337c.htm
---
# Autodesk.Revit.DB.CategoryNameMap.Insert Method

Insert the specified category with the specified name into the map.

## Syntax (C#)
```csharp
public virtual bool Insert(
	string key,
	Category item
)
```

## Parameters
- **key** (`System.String`) - The name to be used for inserting the category into the map.
- **item** (`Autodesk.Revit.DB.Category`) - The category to be inserted into the map.

## Returns
Returns whether the category was inserted into the map.